Hi @yokotaso 👋 Thank you for submitting this and sorry you ran into trouble there. I am unable to reproduce this issue with the latest versions of the Terraform CLI and Terraform AWS Provider.

```hcl
terraform {
  required_providers {
    aws = "2.57.0"
  }
  required_version = "0.12.24"
}

provider "aws" {
  region = "us-east-1"
}

resource "aws_api_gateway_rest_api" "test" {
  name = "bflad-testing"
}

resource "aws_api_gateway_resource" "test" {
  rest_api_id = aws_api_gateway_rest_api.test.id
  parent_id   = aws_api_gateway_rest_api.test.root_resource_id
  path_part   = "test"
}

resource "aws_api_gateway_method" "test" {
  rest_api_id   = aws_api_gateway_rest_api.test.id
  resource_id   = aws_api_gateway_resource.test.id
  http_method   = "GET"
  authorization = "NONE"
}

resource "aws_api_gateway_method_response" "error" {
  rest_api_id = aws_api_gateway_rest_api.test.id
  resource_id = aws_api_gateway_resource.test.id
  http_method = aws_api_gateway_method.test.http_method
  status_code = "400"
}

resource "aws_api_gateway_integration" "test" {
  rest_api_id = aws_api_gateway_rest_api.test.id
  resource_id = aws_api_gateway_resource.test.id
  http_method = aws_api_gateway_method.test.http_method

  type                    = "HTTP"
  uri                     = "https://www.google.co.uk"
  integration_http_method = "GET"
}

resource "aws_api_gateway_integration_response" "test" {
  rest_api_id = aws_api_gateway_rest_api.test.id
  resource_id = aws_api_gateway_resource.test.id
  http_method = aws_api_gateway_integration.test.http_method
  status_code = aws_api_gateway_method_response.error.status_code
}

resource "aws_api_gateway_deployment" "test" {
  depends_on = [aws_api_gateway_integration.test]

  rest_api_id = aws_api_gateway_rest_api.test.id
  stage_name  = ""
}

resource "aws_cloudwatch_log_group" "test" {
  name = "bflad-testing"
}

resource "aws_api_gateway_stage" "test" {
  rest_api_id   = aws_api_gateway_rest_api.test.id
  stage_name    = "test"
  deployment_id = aws_api_gateway_deployment.test.id

  access_log_settings {
    destination_arn = aws_cloudwatch_log_group.test.arn
    format          = <<EOF
{
  "requestId":"$context.requestId", "ip": "$context.identity.sourceIp", 
  "caller":"$context.identity.caller", 
  "user": "$context.identity.user",
  "requestTime":"$context.requestTime", 
  "httpMethod":"$context.httpMethod",
  "resourcePath":"$context.resourcePath", 
  "status":"$context.status",
  "protocol":"$context.protocol", 
  "responseLength":"$context.responseLength" 
}
EOF
  }
}
```

```console
$ terraform apply
...
Plan: 9 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_cloudwatch_log_group.test: Creating...
aws_api_gateway_rest_api.test: Creating...
aws_cloudwatch_log_group.test: Creation complete after 0s [id=bflad-testing]
aws_api_gateway_rest_api.test: Creation complete after 1s [id=3fl29piuq4]
aws_api_gateway_resource.test: Creating...
aws_api_gateway_resource.test: Creation complete after 0s [id=zqyu03]
aws_api_gateway_method.test: Creating...
aws_api_gateway_method.test: Creation complete after 0s [id=agm-3fl29piuq4-zqyu03-GET]
aws_api_gateway_method_response.error: Creating...
aws_api_gateway_integration.test: Creating...
aws_api_gateway_method_response.error: Creation complete after 0s [id=agmr-3fl29piuq4-zqyu03-GET-400]
aws_api_gateway_integration.test: Creation complete after 0s [id=agi-3fl29piuq4-zqyu03-GET]
aws_api_gateway_deployment.test: Creating...
aws_api_gateway_integration_response.test: Creating...
aws_api_gateway_integration_response.test: Creation complete after 0s [id=agir-3fl29piuq4-zqyu03-GET-400]
aws_api_gateway_deployment.test: Creation complete after 0s [id=bhqcat]
aws_api_gateway_stage.test: Creating...

Error: Updating API Gateway Stage failed: BadRequestException: Access Log format must be single line: '{
  "requestId":"$context.requestId", "ip": "$context.identity.sourceIp",
  "caller":"$context.identity.caller",
  "user": "$context.identity.user",
  "requestTime":"$context.requestTime",
  "httpMethod":"$context.httpMethod",
  "resourcePath":"$context.resourcePath",
  "status":"$context.status",
  "protocol":"$context.protocol",
  "responseLength":"$context.responseLength"
}
'

  on main.tf line 64, in resource "aws_api_gateway_stage" "test":
  64: resource "aws_api_gateway_stage" "test" {

$ terraform apply
aws_cloudwatch_log_group.test: Refreshing state... [id=bflad-testing]
aws_api_gateway_rest_api.test: Refreshing state... [id=3fl29piuq4]
aws_api_gateway_resource.test: Refreshing state... [id=zqyu03]
aws_api_gateway_method.test: Refreshing state... [id=agm-3fl29piuq4-zqyu03-GET]
aws_api_gateway_method_response.error: Refreshing state... [id=agmr-3fl29piuq4-zqyu03-GET-400]
aws_api_gateway_integration.test: Refreshing state... [id=agi-3fl29piuq4-zqyu03-GET]
aws_api_gateway_deployment.test: Refreshing state... [id=bhqcat]
aws_api_gateway_integration_response.test: Refreshing state... [id=agir-3fl29piuq4-zqyu03-GET-400]
aws_api_gateway_stage.test: Refreshing state... [id=ags-3fl29piuq4-test]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_stage.test is tainted, so must be replaced
-/+ resource "aws_api_gateway_stage" "test" {
      ~ arn                   = "arn:aws:apigateway:us-east-1::/restapis/3fl29piuq4/stages/test" -> (known after apply)
      - cache_cluster_enabled = false -> null
        deployment_id         = "bhqcat"
      ~ execution_arn         = "arn:aws:execute-api:us-east-1:--OMITTED--:3fl29piuq4/test" -> (known after apply)
      ~ id                    = "ags-3fl29piuq4-test" -> (known after apply)
      ~ invoke_url            = "https://3fl29piuq4.execute-api.us-east-1.amazonaws.com/test" -> (known after apply)
        rest_api_id           = "3fl29piuq4"
        stage_name            = "test"
      - tags                  = {} -> null
      - variables             = {} -> null
      - xray_tracing_enabled  = false -> null

      + access_log_settings {
          + destination_arn = "arn:aws:logs:us-east-1:--OMITTED--:log-group:bflad-testing"
          + format          = jsonencode(
                {
                  + caller         = "$context.identity.caller"
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + protocol       = "$context.protocol"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + resourcePath   = "$context.resourcePath"
                  + responseLength = "$context.responseLength"
                  + status         = "$context.status"
                  + user           = "$context.identity.user"
                }
            )
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_api_gateway_stage.test: Destroying... [id=ags-3fl29piuq4-test]
aws_api_gateway_stage.test: Destruction complete after 1s
aws_api_gateway_stage.test: Creating...

Error: Updating API Gateway Stage failed: BadRequestException: Access Log format must be single line: '{
  "requestId":"$context.requestId", "ip": "$context.identity.sourceIp",
  "caller":"$context.identity.caller",
  "user": "$context.identity.user",
  "requestTime":"$context.requestTime",
  "httpMethod":"$context.httpMethod",
  "resourcePath":"$context.resourcePath",
  "status":"$context.status",
  "protocol":"$context.protocol",
  "responseLength":"$context.responseLength"
}
'

  on main.tf line 64, in resource "aws_api_gateway_stage" "test":
  64: resource "aws_api_gateway_stage" "test" {
```

My best guess here is that an older version of the Terraform CLI may have had a bug where it lost the state of those two attributes when there is a resource creation error. Without more information and the ability to recreate this in an acceptance test that we can verify, we would be hesitant to introduce this type of code change (which is very uncommon in Terraform AWS Provider resources) so I'm going to close this for now.

If you can please open a [bug report](https://github.com/terraform-providers/terraform-provider-aws/issues/new?template=Bug_Report.md) with a fully reproducing configuration on the latest versions of Terraform CLI and Terraform AWS Provider, we will be happy to look into this further and discuss potential fixes. Thank you.